[
    {
        "title": "初投稿",
        "date": "2025-03-27",
        "category": "挨拶", 
        "content": 
        "皆さん初めまして。私は松田です。この度はブログを開設しましたので、そのご挨拶をさせていただいている所存です。毎日投稿していきたいなと思っていますので皆様も良ければどうぞご覧になってください"
    },
    {
        "title": "セカンド投稿",
        "date": "2025-03-27",
        "category":"その他",
        "content": 
        "自己紹介します。好きな食べ物は海鮮のもの全般です。最近は魚屋巡りにはまっています。"
    },
    {
        "title": "教室が暑い",
        "date": "2025-03-27",
        "category":"日記",
        "content": 
        "毎日思うんですけど、教室が暑い。でなければ、寒い。温度調節しやすい服を着てこようと思って毎回忘れます。そんな砂漠みたいな環境の教室からももう卒業です。さみしいな"
    },
    {
        "title": "勉強",
        "date": "2025-03-27",
        "category":"勉強",
        "content": 
        "今日は自作のブログを作ってみました。難しいけど学ぶことが多くて大変力がついたように思います。"
    },
    {
        "title": "あっという間の人生",
        "date": "2025-03-27",
        "category":"日記",
        "content": 
        "人生ってあっという間ですよね。ついこの前まで七五三飴をぺろぺろしたりウルトラマンをそのままはぎ取ったみたいな服を着ていたりしたのに、気づいたら味のよくわからん酒を飲んだり着たくもないリクルートスーツ着てるんですから。あっというまですよほんとに。後悔ないように過ごしたいですね"
    },
    {
        "title": "決戦は金曜日",
        "date": "2025-03-28",
        "category":"日記",
        "content": 
        "今日は金曜日です。特に予定があるとかそういうわけではないんですけど。花金だのなんだのってみんないいますけど、自分は街に人が多いしどこも混んでいるのでそんなにテンションが上がらないです。そうなってくると、平日の休みっていいなと思います。市役所も空いてるし、世のみんな働いているのに自分は自由に行動しているときの万能感が半端ないです。微熱で学校休んで、みんな学校勉強してるのをよそにお家でガンコちゃん見てるときみたいな感覚ありますよね。"
    },
    {
        "title": "ブログの機能更新",
        "date": "2025-04-01",
        "category":"開発",
        "content": 
        "ブログの機能を更新しました。①エンター入力で検索が可能になりました。②タイトル内テキストでも検索が引っかかるように改善しました。③せっかくなので、検索結果の数があればわかりやすいかなと思い実装しました。エンター押下で検索のコードですが、input.addEventListener('keydown', (event) => {if(event.key === 'Enter') {searchBtn.click();}})inputのカーソルにfocusが当たっているときに、keydownのイベントリスナーが使えるのは知らなかったのでここに記しておきます。"
    },
    {
        "title": "27歳になりました",
        "date": "2025-04-08",
        "category":"日記",
        "content": 
        "4月6日に誕生日を迎えまして、20代も残すところあと3年となりました。27歳の自分が無職だなんて、小さい頃の自分が知ったらどんな顔するんですかね。きっと手に持ったDSを閉じて、少しは将来のことなんか考え始めたかもしれませんね。去年は仕事を辞めて金銭的にも時間的にも余裕がなく、26歳は周りの人に助けてもらってばかりの一年だったように思います。27歳は働き始めて、少しづつ周りに恩を返していければいいなと、ひそやかに思っています。"
    },
    {
        "title": "ブログのデザインを更新しました",
        "date": "2025-04-08",
        "category":"開発",
        "content": 
        "後回しにしていたブログのデザインを更新しました。そんなに凝ったものではないですが、多少みやすくなったのではないでしょうか。あとはいいね機能の実装、ブログ更新を簡単にすること、記事にコメントする機能を追加などできたらいいと思います。"
    }
]